[
    {
        "id": "wefwosfiw",
        "title": "Новая большая книга CSS",
        "author": "Дэвид Макфарланд",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1014337293.jpg",
        "description": "Технология CSS3 позволяет создавать профессионально оформленные сайты, но тонкости этого языка могут оказаться довольно сложными даже для опытных веб-разработчиков. Полностью переработанное четвертое издание этой книги поможет вам поднять навыки работы с HTML и CSS на новый уровень; она содержит множество ценных советов, описаний приемов, а также инструкции, написанные в стиле справочного руководства. Веб-дизайнеры, как начинающие, так и опытные, при помощи этой книги быстро научатся создавать красивые веб-страницы, которые при этом молниеносно загружаются как на ПК, так и на мобильных устройствах."
    },
    {
        "id": "bkrpshaqw",
        "title": "React и Redux: функциональная веб-разработка",
        "author": "Алекс Бэнкс, Ева Порселло",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1021367273.jpg",
        "description": "Хотите научиться писать эффективные пользовательские интерфейсы при помощи React? Тогда вы нашли нужную книгу. Авторы расскажут, как создавать пользовательские интерфейсы при помощи этой компактной библиотеки и писать сайты, на которых можно обрабатывать огромные объемы данных без перезагрузки страниц. Также вы изучите новейшие возможности стандарта ECMAScript и функционального программирования."
    },
    {
        "id": "zxcvbnmfd",
        "title": "Язык программирования C",
        "author": "Брайан У. Керниган, Деннис М. Ритчи",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1005667373.jpg",
        "description": "Классическая книга по языку С, написанная самими разработчиками этого языка и выдержавшая в США уже 34 переиздания! Книга является как практически исчерпывающим справочником, так и учебным пособием по самому распространенному языку программирования. Предлагаемое второе издание книги было существенно переработано по сравнению с первым в связи с появлением стандарта ANSI С, для которого она частично послужила основой. Книга не рекомендуется для чтения новичкам; для своего изучения она требует знания основ программирования и вычислительной техники. Книга предназначена для широкого круга программистов и компьютерных специалистов. Может использоваться как учебное пособие для вузов."  },
    {
        "id": "gltporolp",
        "title": "Qt 5.10. Профессиональное программирование на C++",
        "author": "Макс Шлее",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1022581661.jpg",
        "description": "Книга посвящена разработке приложений для Windows, Mac OS X, Linux, Android и iOS с использованием библиотеки Qt версии 5.10. Подробно рассмотрены возможности, предоставляемые этой библиотекой, и описаны особенности, выгодно отличающие ее от других библиотек. Описана интегрированная среда разработки Qt Creator и работа с технологией Qt Quick. Книга содержит исчерпывающую информацию о классах Qt 5, и так же даны практические рекомендации их применения, проиллюстрированные на большом количестве подробно прокомментированных примеров. Проекты примеров из книги размещены на сайте издательства."    
    },
    {
        "id": "kgjeoogjo",
        "title": "Эффективный и современный С++. 42 рекомендации по использованию C++11 и C++14",
        "author": "Скотт Мейерс",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1013639927.jpg",
        "description": "В этой книге отражен бесценный опыт ее автора как программиста на C++. Новые возможности этого языка программирования, появившиеся в стандартах C++11 и C++14 - это не просто новые ключевые слова или функции, это появление совершенно новых концепций, так что для их эффективного использования недостаточно просто узнать об их существовании, и программировать на C++11, как на несколько улучшенном и расширенном функционально C++98. Когда происходят такие глобальные изменения в языке программирования, их изучению следует посвятить определенное время, написать сотни, а еще лучше - тысячи строк кода, и столкнуться с массой проблем, кажущихся тем более странными и непонятными, чем большим опытом работы с C++98 вы обладаете." 
        },
    {
        "id": "vmnnnbogj",
        "title": "Разработка Backbone.js приложений",
        "author": "Эдди Османи",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1018881530.jpg",
        "description": "Backbone – это javascript-библиотека для тяжелых фронтэнд javascript-приложений, таких, например, как gmail или twitter. В таких приложениях вся логика интерфейса ложится на браузер, что дает очень значительное преимущество в скорости интерфейса.Цель этой книги – стать удобным источником информации в помощь тем, кто разрабатывает реальные приложения с использованием Backbone.Издание охватывает теорию MVC и методы создания приложений с помощью моделей, представлений, коллекций и маршрутов библиотеки Backbone; модульную разработку ПО с помощью Backbone.js и AMD (посредством библиотеки RequireJS), решение таких типовых задач, как использование вложенных представлений, устранение проблем с маршрутизацией средствами Backbone и jQuery Mobile, а также многие другие вопросы."
        },
    {
        "id": "iorjiitgv",
        "title": "Изучаем Node. Переходим на сторону сервера",
        "author": "Шелли Пауэрс",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1021908528.jpg",
        "description": "Технология Node.js всё еще молода и в то же время существует достаточно долго, чтобы крупные корпорации (LinkedIn, Yahoo! и Netflix) взяли ее на вооружение.Эта книга посвящена Node и тем модулям, которые образуют базовую функциональность Node. Вы начнете знакомство с основ создания веб-сервера и базовых функциональностей, а затем перейдете к системе модулей, REPL, разработке приложений, проблемам безопасности, дочерним процессам, познакомитесь с новыми функциональностями, появившимися в ES6, комплексной разработкой (Express, MongoDB, Redis, AngularJS и Backbone.js), приемами разработки приложений и, наконец, с использованием Node в других областях, таких как микроконтроллеры и «интернет вещей»."
    },
    {
        "id": "fdlmvdljj",
        "title": "Node.js в действии",
        "author": "Натан Райлих, TJ Головайчук, Марк Хартер, Майк Кантелон, Алекс Янг",
        "image": "https://ozon-st.cdn.ngenix.net/multimedia/1021932039.jpg",
        "description": "Второе издание Node.js в действии было полностью переработано, чтобы отражать реалии, с которыми теперь сталкивается каждый Node-разработчик. Вы узнаете о системах построения интерфейса и популярных веб-фреймворках Node, а также научитесь строить веб-приложения на базе Express с нуля. Теперь вы сможете узнать не только о Node и JavaScript, но и получить всю информацию, включая системы построения фронтэнда, выбор веб-фреймворка, работу с базами данных в Node, тестирование и развертывание веб-приложений. Технология Node все чаще используется в сочетании с инструментами командной строки и настольными приложениями на базе Electron, поэтому в книгу были включены главы, посвященные обеим областям." 
        }
    ]